[General]
ShowWarning=False
#경고문구를 보여줄지 여부 [True/False]
ShowWarningDelay=0
#경구문구를 보여줄 시간 [숫자]
ShowReport=False
#리포트 생성 여부 [True/False]
DoFileBackup=False
#파일 백업 여부 [True/False]

[Folder]
File=.\
#파일 경로 [경로]
Report=.\Report\
#리포트 폴더 경로 [경로]
Backup=.\Backup\
#백업 폴더 경로 [경로]


[File]
Ext1=xlsx
Ext2=xls
Ext3=
Ext4=
Ext5=
#파일 확장자 [확장자]
#현재 xlsx와 xls만 가능함


[HeaderCol]
Field1=상품명
Field2=상품정보
Field3=상품정보(상세)
Field4=상품정보 (상세)
Field5=주문옵션
Field6=상세내역
Field7=구매제품명
Field8=옵션명
Field9=구매상품정보
Field10=옵션

#상품명이 입력된 열의 머리글 목록 [머리글]
#Field숫자(차례대로) 형식으로 10개 이상 추가 가능


[Patterns]
ItemSplit=(\n|\r\n|/|,)
Number=\D(\d+[.)_]|옵션\d+|선택\d+|[①-⑳])\D
Count=\D(\d+)[개]\D
ExtractNumber=(\d+|[①-⑳])
#분류용 패턴들이니 함부로 수정하지 말 것


[Control]
Mode=Auto
#모드 설정 [Auto] 
#현재 (반)자동 모드만 가능함

ModeDelay=3
#모드 설정 화면 대기 시간 [숫자]

MaxItemsCount=26
#최대 옵션 개수
#이와 별개로 원숫자(①)는 20이 최고임

ManageXlsDataWrite=Excel
#xls파일일 경우 결과표 처리 방식 [Txt/Excel]

ManageHeaderColFilters=True
#머리글에 필터 생성 [True/False]
#xls파일일 경우 ManageXlsDataWrite을 Excel로 해도 필터가 생성되지 않음

ManageHeaderColMultipleResult=Select
#머리글이 여러개 있을 때 처리방법 [Select/Ahead/Last]
#양식마다 다를 수 있으므로 직접 고를 수 이쓴 Select를 추천

HeadColColor=FFFFFF00
#결과표의 머리글열 셀색상 설정

TotalRowColor=808080
#결과표의 합계행 셀색상 설정


[ETC]


